` routeros git:(main) ✗ ROS_LOG_COLOR=1 TF_LOG=debug terraform apply
2024-04-04T19:11:23.330+0200 [INFO]  Terraform version: 1.5.7
2024-04-04T19:11:23.331+0200 [DEBUG] using github.com/hashicorp/go-tfe v1.26.0
2024-04-04T19:11:23.331+0200 [DEBUG] using github.com/hashicorp/hcl/v2 v2.16.2
2024-04-04T19:11:23.331+0200 [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.0
2024-04-04T19:11:23.331+0200 [DEBUG] using github.com/zclconf/go-cty v1.12.2
2024-04-04T19:11:23.331+0200 [INFO]  Go runtime version: go1.21.1
2024-04-04T19:11:23.331+0200 [INFO]  CLI args: []string{"terraform", "apply"}
2024-04-04T19:11:23.331+0200 [DEBUG] Attempting to open CLI config file: /Users/anton/.terraformrc
2024-04-04T19:11:23.331+0200 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-04-04T19:11:23.332+0200 [INFO]  Loading CLI configuration from /Users/anton/.terraform.d/credentials.tfrc.json
2024-04-04T19:11:23.333+0200 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-04-04T19:11:23.333+0200 [DEBUG] ignoring non-existing provider search directory /Users/anton/.terraform.d/plugins
2024-04-04T19:11:23.333+0200 [DEBUG] ignoring non-existing provider search directory /Users/anton/Library/Application Support/io.terraform/plugins
2024-04-04T19:11:23.333+0200 [DEBUG] ignoring non-existing provider search directory /Library/Application Support/io.terraform/plugins
2024-04-04T19:11:23.335+0200 [INFO]  CLI command args: []string{"apply"}
2024-04-04T19:11:23.346+0200 [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2024-04-04T19:11:24.637+0200 [DEBUG] Service discovery for app.terraform.io aliased as localterraform.com
2024-04-04T19:11:24.668+0200 [DEBUG] checking for provisioner in "."
2024-04-04T19:11:24.671+0200 [DEBUG] checking for provisioner in "/opt/homebrew/bin"
2024-04-04T19:11:24.870+0200 [INFO]  cloud: starting Apply operation
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
routeros relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /Users/anton/GIT/gs-terraform-cloud/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /Users/anton/GIT/gs-terraform-cloud

To view this run in a browser, visit:
https://app.terraform.io/app/antonsatskyi/terraform-cloud-routeros/runs/run-5ecdEkQCiEFwaKaq

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
routeros_ip_firewall_addr_list.example_list_router1: Refreshing state... [id=*567]
routeros_ip_firewall_addr_list.example_list_router0: Refreshing state... [id=*A]
2024-04-04T19:11:36.058+0200 [DEBUG] performing request: method=GET url=https://app.terraform.io/api/v2/plans/plan-qLAadVLyBuvpfJ57/json-output-redacted

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # routeros_ip_service.this will be created
  + resource "routeros_ip_service" "this" {
      + certificate = "none"
      + disabled    = true
      + id          = (known after apply)
      + invalid     = (known after apply)
      + name        = (known after apply)
      + numbers     = "www"
      + port        = 80
      + tls_version = "any"
      + vrf         = "main"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
2024-04-04T19:11:37.844+0200 [DEBUG] command: asking for input: "\nDo you want to perform these actions in workspace \"terraform-cloud-routeros\"?"

Do you want to perform these actions in workspace "terraform-cloud-routeros"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

routeros_ip_service.this: Creating...
╷
│ Error: from RouterOS device: unknown parameter
│ 
│   with routeros_ip_service.this,
│   on variables.tf line 23, in resource "routeros_ip_service" "this":
│   23: resource "routeros_ip_service" "this" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)`